package com.contractors.app.presentation.ui.screen.reg

val professionList = listOf(
    "Арматурщик",
    "Архитектор",
    "Геодезист",
    "Дизайнер интерьера",
    "Каменщик",
    "Кровельщик",
    "Ландшафтный дизайнер",
    "Маляр",
    "Мастер гидроизоляции",
    "Мастер монтажа систем отопления, водоснабжения и канализации",
    "Мастер по монтажу внешних инженерных систем",
    "Мастер по монтажу лепнины и декора",
    "Мастер по монтажу систем водоочистки",
    "Мастер по монтажу систем кондиционирования и вентиляции",
    "Мастер по производству мебели и ее сборки",
    "Мастер по стяжке пола",
    "Мастер по укладке плитки",
    "Мастер по укладке тротуара и тротуарной плитки и иных покрытий",
    "Мастер по установке межкомнатных дверей",
    "Мастер по установке окон и дверей",
    "Мастер по установке сантехники",
    "Мастер по утеплению конструкций",
    "Монолитчик",
    "Монтажник гипсокартонных конструкций",
    "Монтажник натяжных потолков",
    "Монтажник слаботочных систем",
    "Монтажник электрических сетей",
    "Охранник",
    "Печник-мангальщик",
    "Плотник",
    "Проектировщик",
    "Разнорабочий",
    "Садовник",
    "Специалис по управлению Специальной строительной техникой",
    "Специалист мо монтажу систем дымоходов",
    "Специалист по бурению скважин для питьевой воды",
    "Специалист по высадке растений",
    "Специалист по монтажу ЖБИ",
    "Специалист по монтажу систем водоотведения",
    "Специалист по монтажу систем полива",
    "Специалист по укладке напольных покрытий",
    "Специалист по установке бассейна",
    "Специалист по установке гаражных ворот и калиток",
    "Специалист по установке и монтажу каминов",
    "Столяр",
    "Шпаклевщик",
    "Штукатурщик"
)

val skillsList = listOf(
    "Менее 1 года",
    "1 год",
    "2 года",
    "3 года",
    "4 года",
    "5 лет и более",
    "10 лет и более",
    "15 лет и более",
    "20 лет и более",
)

val roleList = listOf(
    "Прораб",
    "Подрядчик"
)

val objectTypeList = listOf(
    "Бани",
    "Временные объекты недвижимости",
    "ИЖС (индивидуальное жилое строение)",
    "Коммерческая недвижимость",
    "Промышленные здания и сооружения",
    "Иное (пергалы, беседки и т.д.)",
)